src/InformationRegisters/ОчередьОтправкиДокументовОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОтправкиДокументовОтгрузки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтменыОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОчередьОтправкиДокументовОтгрузки/Ext/ManagerModule.bsl
Процедура Добавить(Контрагент, Документ, Период = Неопределено, ДатаОтправки = Неопределено, ДатаОтменыОтправки = Неопределено, Комментарий = "", Ошибка = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ 						= РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СоздатьМенеджерЗаписи();
	МЗ.Документ 			= Документ;
	МЗ.Контрагент 			= Контрагент;
	МЗ.Период 				= ?(ЗначениеЗаполнено(Период), Период, ТекущаяДата());
	МЗ.ДатаОтправки 		= ДатаОтправки;
	МЗ.ДатаОтменыОтправки 	= ДатаОтменыОтправки;
	МЗ.Комментарий 			= Комментарий;
	МЗ.Ошибка 				= Ошибка;
	МЗ.Записать();
	
КонецПроцедуры

Процедура ДобавитьКОтправке(Контрагент, Документ, Период = Неопределено, Комментарий = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеДокумента = СостояниеДокумента(Документ, Контрагент);
	Если СостояниеДокумента.ДатаОтправки = Дата(1,1,1)
		И СостояниеДокумента.ДатаОтменыОтправки = Дата(1,1,1) Тогда 
		//Документ уже стоит в очереди на отправку
		Возврат;
	КонецЕсли;
	
	Добавить(Контрагент, Документ, Период, Комментарий );
	
КонецПроцедуры


Процедура Удалить(Документ, Контрагент = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НЗ.Отбор.Контрагент.Установить(Контрагент);
	КонецЕсли;
	НЗ.Записать();
	
КонецПроцедуры

Процедура УстановитьДатуОтправки(Документ, Контрагент = Неопределено, ДатаОтправки = Неопределено, Комментарий = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НЗ.Отбор.Контрагент.Установить(Контрагент);
	КонецЕсли;
	
	НЗ.Прочитать();
	Для каждого ЗаписьНабора Из НЗ Цикл
		Если Не ЗначениеЗаполнено(ЗаписьНабора.ДатаОтправки) И Не ЗначениеЗаполнено(ЗаписьНабора.ДатаОтменыОтправки) Тогда
			ЗаписьНабора.ДатаОтправки 	= ?(ЗначениеЗаполнено(ДатаОтправки), ДатаОтправки, ТекущаяДата());
			ЗаписьНабора.Комментарий 	= Комментарий;
			ЗаписьНабора.Ошибка 		= Ложь;
		КонецЕсли;
	КонецЦикла;
	Если НЗ.Количество() > 0 Тогда
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуОтменыОтправки(Документ, Контрагент = Неопределено, ДатаОтменыОтправки = Неопределено, Комментарий = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НЗ.Отбор.Контрагент.Установить(Контрагент);
	КонецЕсли;
	НЗ.Прочитать();
	Для каждого ЗаписьНабора Из НЗ Цикл
		Если Не ЗначениеЗаполнено(ЗаписьНабора.ДатаОтправки) И Не ЗначениеЗаполнено(ЗаписьНабора.ДатаОтменыОтправки) Тогда
			ЗаписьНабора.ДатаОтменыОтправки = ?(ЗначениеЗаполнено(ДатаОтменыОтправки), ДатаОтменыОтправки, ТекущаяДата());
			ЗаписьНабора.Комментарий 		= Комментарий;
			ЗаписьНабора.Ошибка 			= Ложь;
		КонецЕсли;
	КонецЦикла;
	Если НЗ.Количество() > 0 Тогда
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОшибкуОтправки(Документ, Контрагент =Неопределено, Комментарий = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НЗ.Отбор.Контрагент.Установить(Контрагент);
	КонецЕсли;
	НЗ.Прочитать();
	Для каждого ЗаписьНабора Из НЗ Цикл
		Если Не ЗначениеЗаполнено(ЗаписьНабора.ДатаОтправки) Тогда
			ЗаписьНабора.Комментарий = Комментарий;
			ЗаписьНабора.Ошибка 	 = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЗ.Количество() > 0 Тогда
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СостояниеДокумента(Документ, Контрагент = Неопределено, СостояниеСтрокой = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	СостояниеДокумента = Новый Структура("Документ, ДатаОтправки, ДатаОтменыОтправки, Комментарий, Ошибка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьОтправкиДокументовОтгрузкиСрезПоследних.Документ,
	|	ОчередьОтправкиДокументовОтгрузкиСрезПоследних.ДатаОтправки,
	|	ОчередьОтправкиДокументовОтгрузкиСрезПоследних.ДатаОтменыОтправки,
	|	ОчередьОтправкиДокументовОтгрузкиСрезПоследних.Комментарий,
	|	ОчередьОтправкиДокументовОтгрузкиСрезПоследних.Ошибка
	|ИЗ
	|	РегистрСведений.ОчередьОтправкиДокументовОтгрузки.СрезПоследних(
	|			,
	|			Документ = &Документ
	|				И (Контрагент = &Контрагент
	|					ИЛИ &ВсеКонтрагенты)) КАК ОчередьОтправкиДокументовОтгрузкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВсеКонтрагенты", Не ЗначениеЗаполнено(Контрагент));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СостояниеДокумента, Выборка); 
	КонецЕсли;
	
	Если СостояниеСтрокой Тогда
		
		Если СостояниеДокумента.Документ = Неопределено Тогда
			//Нет ни одной записи
			ВозвращаемоеЗначение = "Документ не отмечен к отправке";
		ИначеЕсли СостояниеДокумента.Ошибка Тогда
			ВозвращаемоеЗначение = "Не удалось отправить документ по причине: "+СостояниеДокумента.Комментарий+". Документ ожидает повторной отправки.";
		ИначеЕсли ЗначениеЗаполнено(СостояниеДокумента.ДатаОтменыОтправки) Тогда
			ВозвращаемоеЗначение = "Отправка документа отменена "+СостояниеДокумента.ДатаОтменыОтправки+", "+СостояниеДокумента.Комментарий;
		ИначеЕсли Не ЗначениеЗаполнено(СостояниеДокумента.ДатаОтправки) Тогда
			ВозвращаемоеЗначение = "Документ ожидает отправки";
		Иначе
			ВозвращаемоеЗначение = "Документ отправлен "+СостояниеДокумента.ДатаОтправки;
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение = СостояниеДокумента;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура УстановитьБлокировку(Документ) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьОтправкиДокументовОтгрузки");
	ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

КонецПроцедуры
